#pragma once
#include "CGameObject/CStage/CStageCollision/CStageCollision.h"	//ステージ当たり判定クラス
#include "CGameObject/CStage/CStageLoader/CStageLoader.h"		//ステージ読み込み定クラス
#include "CGameObject/CStage/CStageDraw/CStageDraw.h"			//ステージ描画クラス

#include "CGameObject/CCharacter/CCharacter.h"			//キャラクタークラス



class CStageManager
{
public:
	CStageManager();
	~CStageManager();

	/*****************************************************************************************
	* @brief    作成関数
	*****************************************************************************************/
	bool Create();


	/*****************************************************************************************
	* @brief    初期化関数
	*****************************************************************************************/
	void Init();


	/*****************************************************************************************
	* @brief    更新関数
	*****************************************************************************************/
	void Update();


	/*****************************************************************************************
	* @brief    描画関数
	*****************************************************************************************/
	void Draw(std::unique_ptr<CCamera>& pCamera);


	/*****************************************************************************************
	* @brief    解放関数
	*****************************************************************************************/
	void Destroy();


	/*****************************************************************************************
	* @brief    マップの大きさを取得する関数
	*****************************************************************************************/
	std::pair<float, float> GetMapSize() { return { m_upStageLoader->GetWidth(), m_upStageLoader->GetHeight() }; }


	/*****************************************************************************************
	* @brief    衝突判定
	* @param    charactor : 当たり判定を行いたいキャラクターのアドレス
	* 
	* @return   当たっているかどうか
	*****************************************************************************************/
	bool IsHit(CCharacter& charactor);


	/*****************************************************************************************
	* @brief    EventChipに当たっているかどうかを取得する関数
	* 
	* @return   当たっているかどうか
	*****************************************************************************************/
	bool IsEventChipHit() { return m_upStageCollision->GetIsEventChipHit(); }

private:

	std::unique_ptr<CStageCollision> m_upStageCollision;	//ステージの当たり判定クラス
	std::unique_ptr<CStageLoader>	 m_upStageLoader;		//ステージ読み込みクラス
	std::unique_ptr<CStageDraw>		 m_upStageDraw;			//ステージ描画クラス

};