#pragma once
#include "CGameObject/CStage/CStageCollision/CStageCollision.h"	//ステージ当たり判定クラス
#include "CGameObject/CStage/CStageLoader/CStageLoader.h"		//ステージ読み込み定クラス
#include "CGameObject/CStage/CStageDraw/CStageDraw.h"			//ステージ描画クラス

#include "CGameObject/CCharacter/CCharacter.h"			//キャラクタークラス

#include <unordered_map>
#include <string>

class CStageManager
{
public:

	enum class enStage
	{
		Map01 = 0,
		Map02,
	};

	CStageManager();
	~CStageManager();

	/*****************************************************************************************
	* @brief    作成関数
	*****************************************************************************************/
	bool Create();

	/*****************************************************************************************
	* @brief    初期化関数
	*****************************************************************************************/
	void Init();


	/*****************************************************************************************
	* @brief    更新関数
	*****************************************************************************************/
	void Update();


	/*****************************************************************************************
	* @brief    描画関数
	*****************************************************************************************/
	void Draw(std::unique_ptr<CCamera>& pCamera);


	/*****************************************************************************************
	* @brief    解放関数
	*****************************************************************************************/
	void Destroy();


	/*****************************************************************************************
	* @brief    マップの大きさを取得する関数
	*****************************************************************************************/
	std::pair<float, float> GetMapSize() { return { m_upStageLoader->GetWidth(), m_upStageLoader->GetHeight() }; }


	/*****************************************************************************************
	* @brief    衝突判定
	* @param    charactor : 当たり判定を行いたいキャラクターのアドレス
	* 
	* @return   当たっているかどうか
	*****************************************************************************************/
	bool IsHit(CCharacter& charactor);


	/*****************************************************************************************
	* @brief    ステージのファイル名をセットする関数
	*****************************************************************************************/
	void SetStageData();


	/*****************************************************************************************
	* @brief    ステージの切り替え
	* @param    stageNum : 切り替えたいステージの番号
	*****************************************************************************************/
	void ChangeStage(enStage stageNum);

private:

	std::unique_ptr<CStageCollision> m_upStageCollision;	//ステージの当たり判定クラス
	std::unique_ptr<CStageLoader>	 m_upStageLoader;		//ステージ読み込みクラス
	std::unique_ptr<CStageDraw>		 m_upStageDraw;			//ステージ描画クラス

	std::unordered_map<enStage, std::string> m_StageName;	//全ステージの名前
};